#include <stdio.h>
#include <stdlib.h>
#include <string.h>
//ЗАДАНИЕ 6
//Создать текстовый файл с записями следующего вида: +
//Иванов Петр Сергеевич 1975
//Сидоров Николай Андреевич 1981
//Воробьянинов Ипполит Матвеевич 1978
//Прочитать данные из этого файла и записать в другой только те строки, которые относятся к родившимся позднее 1980 года.

int main() {
	
	int year;
	FILE f1*;
	f1 = fopen("text.txt", "rt");
	char line[256];
	
	while(fgets(line, sizeof(line), (input) != null);
	
	
	
	
}
